# Reworking Pandas on Python 3

In [1]:
import pandas as pd
import numpy as np

### 1. Assign a new Column

In [4]:
df = pd.DataFrame()
df['name'] = ['John', 'Steve', 'Sarah']
df

    name
0   John
1  Steve
2  Sarah

In [5]:
df.assign(age = [31, 32, 19])

    name  age
0   John   31
1  Steve   32
2  Sarah   19

### 2. Create A Pipeline in Pandas

In [6]:
df = pd.DataFrame()
df['name'] = ['John', 'Steve', 'Sarah']
df['gender'] = ['Male', 'Male', 'Female']
df['age'] = [31, 32, 19]
df

    name  gender  age
0   John    Male   31
1  Steve    Male   32
2  Sarah  Female   19

In [7]:
def mean_age_by_group(dataframe, col):
    return dataframe.groupby(col).mean()

In [10]:
def uppercase_column_name(dataframe):
    dataframe.columns = dataframe.columns.str.upper()
    return dataframe

In [11]:
(df.pipe(mean_age_by_group, col='gender')
    .pipe(uppercase_column_name))

         AGE
gender
Female  19.0
Male    31.5

### 3. Group Pandas Data by Hour of the Day

In [13]:
time = pd.date_range('1/1/2000', periods=2000, freq='5min')
series = pd.Series(np.random.randint(100, size=2000), index=time)

In [17]:
series[0:10]

2000-01-01 00:00:00    29
2000-01-01 00:05:00    85
2000-01-01 00:10:00    24
2000-01-01 00:15:00    34
2000-01-01 00:20:00    87
2000-01-01 00:25:00     3
2000-01-01 00:30:00    29
2000-01-01 00:35:00    75
2000-01-01 00:40:00    25
2000-01-01 00:45:00    80
Freq: 5T, dtype: int64

In [18]:
series.groupby(series.index.hour).mean()

0     47.440476
1     51.369048
2     48.702381
3     46.190476
4     51.821429
5     50.119048
6     45.940476
7     40.654762
8     50.523810
9     42.666667
10    49.714286
11    44.809524
12    50.714286
13    45.785714
14    45.785714
15    51.166667
16    52.690476
17    52.726190
18    51.988095
19    45.678571
20    47.500000
21    48.571429
22    52.600000
23    50.083333
dtype: float64

### 4. Sort A List of Names By Last Name

In [19]:
commander_names = ['Alan Brooke', 'George Marshall', 'Frank Jack Fletcher', 'Conrad Helfrich', 'Albert Kessel']

In [22]:
sorted(commander_names, key=lambda x: x.split(" ")[-1])

['Alan Brooke',
 'Frank Jack Fletcher',
 'Conrad Helfrich',
 'Albert Kessel',
 'George Marshall']

### 5. Sort A List of Strings By Length

In [23]:
commander_names = ['Alan Brooke', 'George Marshall', 'Frank Jack Fletcher', 'Conrad Helfrich', 'Albert Kessel']

In [24]:
sorted(commander_names, key=lambda x: len(x))

['Alan Brooke',
 'Albert Kessel',
 'George Marshall',
 'Conrad Helfrich',
 'Frank Jack Fletcher']

### 6. Rename Column Headers In Pandas

In [4]:
raw = {
    '0': ['first_name', 'Molly', 'Tina', 'Jake', 'Amy'],
    '1': ['age', 52, 36, 24, 73],
    '2': ['preTestScore', 24, 31, 2, 3]
}

df = pd.DataFrame(raw)
df

            0    1             2
0  first_name  age  preTestScore
1       Molly   52            24
2        Tina   36            31
3        Jake   24             2
4         Amy   73             3

In [6]:
header = df.iloc[0]
header

0      first_name
1             age
2    preTestScore
Name: 0, dtype: object

In [7]:
df = df[1:]

In [8]:
df.rename(columns = header)

  first_name age preTestScore
1      Molly  52           24
2       Tina  36           31
3       Jake  24            2
4        Amy  73            3

### 7. Converting A String Categorical Variable To A Numeric Variable

In [10]:
raw_data = {
    'patient': [1,1,1,2,2],
    'obs': [1,2,3,1,2],
    'treatment': [0,1,0,1,0],
    'score': ['strong', 'weak', 'normal', 'weak', 'strong']
}

df = pd.DataFrame(raw_data, columns=['patient','obs','treatment','score'])
df

   patient  obs  treatment   score
0        1    1          0  strong
1        1    2          1    weak
2        1    3          0  normal
3        2    1          1    weak
4        2    2          0  strong

In [11]:
def score_to_numeric(x):
    if x=='strong':
        return 3
    if x=='normal':
        return 2
    if x=='weak':
        return 1

In [12]:
df['score_num'] = df['score'].apply(score_to_numeric)
df

   patient  obs  treatment   score  score_num
0        1    1          0  strong          3
1        1    2          1    weak          1
2        1    3          0  normal          2
3        2    1          1    weak          1
4        2    2          0  strong          3

### 8. Apply Functions By Group in Pandas

In [3]:
data = {
    'Platoon': ['A','A','A','A','A','A','B','B','B','B','B','C','C','C','C','C',],
    'Casualties': [1,4,5,7,5,5,6,1,4,5,6,7,4,6,4,6]
}
df = pd.DataFrame(data)
df

    Casualties Platoon
0            1       A
1            4       A
2            5       A
3            7       A
4            5       A
5            5       A
6            6       B
7            1       B
8            4       B
9            5       B
10           6       B
11           7       C
12           4       C
13           6       C
14           4       C
15           6       C

In [19]:
df.groupby('Platoon').count()

         Casualties
Platoon
A                 6
B                 5
C                 5

In [9]:
p = df.groupby('Platoon')['Casualties'].apply(lambda x:x.rolling(center=False,window=2).mean())

0     NaN
1     2.5
2     4.5
3     6.0
4     6.0
5     5.0
6     NaN
7     3.5
8     2.5
9     4.5
10    5.5
11    NaN
12    5.5
13    5.0
14    5.0
15    5.0
Name: Casualties, dtype: float64

### 9. Applying operations Over Pandas DataFrames

In [3]:
data = {
    'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
    'year': [2012, 2012, 2013, 2014, 2014],
    'reports': [4, 24, 31, 2, 3],
    'coverage': [25, 94, 57, 62, 70]
}
df = pd.DataFrame(data, index=['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

            coverage   name  reports  year
Cochice           25  Jason        4  2012
Pima              94  Molly       24  2012
Santa Cruz        57   Tina       31  2013
Maricopa          62   Jake        2  2014
Yuma              70    Amy        3  2014

In [4]:
capitalizer = lambda x: x.upper()

In [5]:
df.name.apply(capitalizer)

Cochice       JASON
Pima          MOLLY
Santa Cruz     TINA
Maricopa       JAKE
Yuma            AMY
Name: name, dtype: object

In [6]:
df.name.map(capitalizer)

Cochice       JASON
Pima          MOLLY
Santa Cruz     TINA
Maricopa       JAKE
Yuma            AMY
Name: name, dtype: object

In [9]:
df = df.drop('name', axis=1)

In [10]:
df.applymap(np.sqrt)

            coverage   reports       year
Cochice     5.000000  2.000000  44.855323
Pima        9.695360  4.898979  44.855323
Santa Cruz  7.549834  5.567764  44.866469
Maricopa    7.874008  1.414214  44.877611
Yuma        8.366600  1.732051  44.877611

In [11]:
def times100(x):
    if type(x) is str:
        return x
    elif x:
        return 100*x
    else:
        return

In [12]:
df.applymap(times100)

            coverage  reports    year
Cochice         2500      400  201200
Pima            9400     2400  201200
Santa Cruz      5700     3100  201300
Maricopa        6200      200  201400
Yuma            7000      300  201400

### 10. Apply Operations of Groups in Pandas

In [2]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'],
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'],
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'],
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['regiment', 'company', 'name', 'preTestScore', 'postTestScore'])
df

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

In [3]:
groupby_regiment = df['preTestScore'].groupby(df['company'])
groupby_regiment

In [4]:
list(groupby_regiment)

[('1st', 0     4
  1    24
  4     3
  5     4
  8     2
  9     3
  Name: preTestScore, dtype: int64), ('2nd', 2     31
  3      2
  6     24
  7     31
  10     2
  11     3
  Name: preTestScore, dtype: int64)]

In [5]:
df['preTestScore'].groupby(df['company']).describe()

         count       mean        std  min   25%   50%    75%   max
company
1st        6.0   6.666667   8.524475  2.0  3.00   3.5   4.00  24.0
2nd        6.0  15.500000  14.652645  2.0  2.25  13.5  29.25  31.0

In [6]:
groupby_regiment.mean()

company
1st     6.666667
2nd    15.500000
Name: preTestScore, dtype: float64

In [8]:
df['preTestScore'].groupby([df['regiment'], df['company']]).mean()

regiment    company
Dragoons    1st         3.5
            2nd        27.5
Nighthawks  1st        14.0
            2nd        16.5
Scouts      1st         2.5
            2nd         2.5
Name: preTestScore, dtype: float64

In [9]:
df['preTestScore'].groupby([df['regiment'], df['company']]).mean().unstack()

company      1st   2nd
regiment
Dragoons     3.5  27.5
Nighthawks  14.0  16.5
Scouts       2.5   2.5

In [10]:
df.groupby(['regiment', 'company']).mean()

                    preTestScore  postTestScore
regiment   company
Dragoons   1st               3.5           47.5
           2nd              27.5           75.5
Nighthawks 1st              14.0           59.5
           2nd              16.5           59.5
Scouts     1st               2.5           66.0
           2nd               2.5           66.0

In [11]:
df.groupby(['regiment', 'company']).size()

regiment    company
Dragoons    1st        2
            2nd        2
Nighthawks  1st        2
            2nd        2
Scouts      1st        2
            2nd        2
dtype: int64

In [13]:
for name, group in df.groupby('regiment'):
    print(name)
    print(group)

Dragoons
   regiment company    name  preTestScore  postTestScore
4  Dragoons     1st   Cooze             3             70
5  Dragoons     1st   Jacon             4             25
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57
Nighthawks
     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62
Scouts
   regiment company   name  preTestScore  postTestScore
8    Scouts     1st  Sloan             2             62
9    Scouts     1st  Piger             3             70
10   Scouts     2nd  Riani             2             62
11   Scouts     2nd    Ali             3             70

In [14]:
list(df.groupby(df.dtypes, axis=1))

[(dtype('int64'),     preTestScore  postTestScore
  0              4             25
  1             24             94
  2             31             57
  3              2             62
  4              3             70
  5              4             25
  6             24             94
  7             31             57
  8              2             62
  9              3             70
  10             2             62
  11             3             70),
 (dtype('O'),       regiment company      name
  0   Nighthawks     1st    Miller
  1   Nighthawks     1st  Jacobson
  2   Nighthawks     2nd       Ali
  3   Nighthawks     2nd    Milner
  4     Dragoons     1st     Cooze
  5     Dragoons     1st     Jacon
  6     Dragoons     2nd    Ryaner
  7     Dragoons     2nd      Sone
  8       Scouts     1st     Sloan
  9       Scouts     1st     Piger
  10      Scouts     2nd     Riani
  11      Scouts     2nd       Ali)]